---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.SetValues(System.Collections.Generic.ICollection{Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue})
source: html/f602e175-2135-be17-81cd-9ca8bcf178ba.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.SetValues Method

Sets the value set to the demand factor definition.

## Syntax (C#)
```csharp
public void SetValues(
	ICollection<ElectricalDemandFactorValue> values
)
```

## Parameters
- **values** (`System.Collections.Generic.ICollection < ElectricalDemandFactorValue >`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null